---
kind: property
id: P:Autodesk.Revit.DB.SweptProfile.EndSetBack
source: html/61a491cc-0d09-175f-39b5-ee9a52871d47.htm
---
# Autodesk.Revit.DB.SweptProfile.EndSetBack Property

The distance from the end of the driving curve to the point where the sweep actually ends.

## Syntax (C#)
```csharp
public double EndSetBack { get; }
```